ben/blog/2026-01-11-journal.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Journal for the week of Jan 4th</title>
<meta name="author" content="Ben" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Journal for the week of Jan 4th</h1>
<p><strong>Tags:</strong> <span class="tags"><a href="tags/languages.html">languages</a> <a href="tags/journal.html">journal</a> <a href="tags/learning.html">learning</a></span></p>

<div id="outline-container-orgd9d3ea2" class="outline-2">
<h2 id="orgd9d3ea2">Quote of the Week</h2>
<div class="outline-text-2" id="text-orgd9d3ea2">
<p>
"Never allow waiting to become a habit. Live your dreams and take risks. Life is happening now."
</p>

<ul class="org-ul">
<li><span class="underline">Paulo Coelho</span></li>
</ul>
</div>
</div>
<div id="outline-container-orgd5124ec" class="outline-2">
<h2 id="orgd5124ec">New Year's Resolutions</h2>
<div class="outline-text-2" id="text-orgd5124ec">
<p>
I don't usually think too much about resolutions because I try not to wait to change habits. But I have a few things I want to do this year.
</p>
</div>
<div id="outline-container-orge5311e8" class="outline-3">
<h3 id="orge5311e8">1. V1 of Shandalar 30</h3>
<div class="outline-text-3" id="text-orge5311e8">
<p>
This is the big goal for the year. I will be really happy if I can get a functional game out by EOY. I've got a good start, but there's still so much to do. I'm using AI and it helps a lot, but it still takes time. Time to spec out how the features should work. Time to write up docs to explain to the AI how it works. And time to review/test the changes AI has made.
</p>

<p>
My book group is currently reading "Vibe Coding" so I'll try to pick up ideas to improve implementation speed.
</p>
</div>
</div>
<div id="outline-container-org13b3397" class="outline-3">
<h3 id="org13b3397">2. Teach a class?</h3>
<div class="outline-text-3" id="text-org13b3397">
<p>
This is a maybe, I'll see how I feel after Recurse Center. Also, I'm not sure what teaching CS even looks like anymore. AI is so transformational it's hard to know how to teach programming now.
</p>
</div>
</div>
<div id="outline-container-org885d459" class="outline-3">
<h3 id="org885d459">3. Lift and stretch regularly</h3>
<div class="outline-text-3" id="text-org885d459">
<p>
Not too much in this one. I already lift and stretch occasionally, but I'd like to make it more of a habit, at least 2x/wk for lifting and 3x/wk for stretching.
</p>
</div>
</div>
<div id="outline-container-org842e68e" class="outline-3">
<h3 id="org842e68e">4. See family and friends more</h3>
<div class="outline-text-3" id="text-org842e68e">
<p>
Depending on what I do after Recurse center I'd like to try and see people more. If I stop working it will make it easier to see my parents and grandparents.
</p>
</div>
</div>
</div>
<div id="outline-container-org7024096" class="outline-2">
<h2 id="org7024096">House Projects</h2>
<div class="outline-text-2" id="text-org7024096">
<p>
I had to work a full week this week, so rude :). We picked up a small bookcase from the side of the road. It's solid wood, I would guess old growth Douglas fir or similar. It's been stained and finished, but the finish has mostly worn off the top and the shelves. I'm hoping to sand and refinish it. Rebuilding center offers a refinishing class, but there aren't any instances on their class calendar.
</p>
</div>
</div>
<div id="outline-container-orga8271ae" class="outline-2">
<h2 id="orga8271ae">Spanish</h2>
<div class="outline-text-2" id="text-orga8271ae">
<p>
I'm not doing much Spanish practice lately. Duolingo started offering chess lessons and I've been doing that instead. Something about puzzle/problem solving is really rewarding to me compared to learning a language. I also don't make many opportunities to practice speaking, which would make Spanish more valuable to me. As it is now I really only get the joy of reading in Spanish and I'm not good enough to read anything interesting enough to hold my attention.
</p>
</div>
</div>
<div id="outline-container-org858f5e3" class="outline-2">
<h2 id="org858f5e3">Recurse Center/Shandalar 30th Anniversary Edition</h2>
<div class="outline-text-2" id="text-org858f5e3">
<p>
I'm also looking more at housing options in New York. I've seen a few good options and am waiting to hear back from someone. Renting a single apartment is about 1.5x - 2x the cost of a shared room a house, but Andrea said she wouldn't feel comfortable visiting me otherwise. I'm not sure what I'll do after Recurse Center. After getting a beta version of Shandalar 30 out I figure it will be at least 6 months of work to get the final version out. 2027 is the 30th anniversary, so I should have something by then.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2026-01-11</p>
<p class="author">Author: Ben</p>
</div>
</body>
</html>
